{
  "functional-javascript-workshop": "Learn fundamental functional programming features of JavaScript in vanilla ES5.", 
  "shader-school": "Learn the fundamentals of graphics programming using GLSL shaders.",
  "levelmeup": "Learn to use leveldb, a simple key/value store with a vibrant package.",
  "bytewiser": "Learn how to manipulate binary data in node.js and HTML5 browsers.", 
  "expressworks": "Learn the basics of the Express.js framework.",
  "bug-clinic": "Learn some new tools and techniques as you improve your debugging skills.",
  "makemehapi": "Learn all about hapi through a series of challenges.",
  "browserify-adventure": "Use npm modules and node-style require() in the browser with browserify.",
  "promise-it-wont-hurt": "Learn to use promises in JavaScript to handle async operations.",
  "introtowebgl": "Get started with three.js and WebGL.",
  "async-you": "Learn to use the async package.",
  "count-to-6": "Learn how to use some features from ES6, the next version of JavaScript.",
  "nodebot-workshop": "Make robots with the johnny-five api.",
  "kick-off-koa": "Getting started with Koa, the next generation web framework for Node.js.",
  "goingnative": "An exploration of Node.js from the underside: native C++ add-ons.",
  "lololodash": "Learn Lo-Dash (fork of underscore) to handle your arrays and objects simple!",
  "planetproto": "Understanding JavaScript Prototypes.",
  "learnyoucouchdb": "Learn about CouchDB - the database that completely embraces the web.",
  "webgl-workshop": "Learn the basics of WebGL in small, manageable chunks.",
  "learnuv": "Learn uv for fun and profit, a self guided workshop to the library that powers Node.js.",
  "esnext-generation": "Intro to ES6 Iterators, their use, and how they relate to Generators.",
  "learn-generators": "An Intro to JavaScript ES6 Generators.",
  "test-anything": "Learn to test your code.",
  "learnyoureact": "Let's learn React.js and server side rendering!",
  "tower-of-babel": "Show you through a series of exercises that introduce you to ES6 features.",
  "perfschool": "Find your way through the web performance optimization maze!",
  "learnyoumongo": "Getting started with MongoDB and Node.js.",
  "web-audio-school": "Learn the Web Audio API by completing a series of interactive lessons with a focus on music.",
  "regex-adventure": "Parse text with regular expressions.",
  "torrential": "A set of lessons to show you how to create a simple p2p bittorrent network.",
  "learn-sass": "Learn the basics of SASS.",
  "thinking-in-react": "Learn React's philosophy by building a UI from scratch.",
  "pattern-lab-workshop": "Learn the basics of Pattern Lab.",
  "node-debug-school": "Learn how to use post-mortem debugging on SmartOS to efficiently debug Node.js applications in production.",
  "learnyoubash": "Learn you how to use the terminal and write your first Bash script.",
  "seneca-in-practice": "Learn how to leverage SenecaJs microservice toolkit.",
  "currying-workshopper": "Learn currying concept and creating a currying function in JavaScript.",
  "less-is-more": "Learn the fundamentals of the LESS CSS preprocessor.",
  "bacon-love": "Learn concepts of Functional and Reactive Programming using the Bacon.js library.",
  "js-best-practices": "Learn the best practices of writing clean JavaScript code.",
  "innersourceadventure": "Learn about InnerSource software development."
}
